



var col = [
 ["Талиесин","КатШи","Бьера","Самилданах","ТуатаДеДаннан",
 "ТуатаДеДаннанчокер","Самайн","Самайнчокер","Мерлин",
 "Мерлинчокер","Фаль","Пендрагон","Нимуэ","Морриган",
 "Моргана","Льосальвар","КорольАртур","КальяхВаре",
 "Бран","Вервольф"],
 ["Агассу", "Кватхламба", "Эрборе", "Ападемак", "Нгвеньяма"],
 ["Дябдар", "ОдоленьТрава", "Змиулан", "ПеруновЦвет",
 "Алконост", "Василиск", "Велес", "Гамаюн",
 "ОдоленьТравачокер", "Ольхон", "СерыйВолк",
 "ТайгаТайга", "ЧёрныйВорон", "СерыйВолкчокер",
 "ХозяйкаМеднойГоры", "ХозяинТайги", "КалиновМост",
 "Полоз"],
 ["Шиутекутли", "Фо", "Уктена", "Тортуга",
 "Кецалькоатль", "Кавиль", "Амазония", "ОгненнаяЗемля",
 "ОгненнаяЗемлячокер", "Томагавк", "Вахиро", "Ягуар",
 "МачуПикчу", "Теночтитлан"],
 ["Атар", "Серафим","Бастет","Тамерлан","Одиссей",
 "Чингисхан","Чингисханчокерр","Ифрит","Ифритчокер",
 "Яломиште","Тутанхамон","Туран","Маахес","Тариэль",
 "Арктос","Ассирия","Анубис","Согдиана"],
 ["Бодхисатва","Хануман","Сидхи","Свадхистана",
 "Сахасрара","Самурай","Анахата","Джомолунгма",
 "Кайлас","Кицунэ","Каштрий","НефритовыйДракон",
 "НефритовыйДракончокер","Цинлун","Непал","Тантра",
 "Раджпут","ХуЧжао"],
 ["Фрея","Нифльхейм","Сейд","Локи","Берсерк",
 "Валькирия","Гиперборея","Драккар","Конунг",
 "Рагнарёк","Сигвальд","Страндваскаре","Ульвар",
 "Хель","Хугин","Ярл","Конунгчокер","Уроборос",
 "Асгард","Ульфберт","Йормунганд","Фенрир"],
 ["Рюдзин","Амфитрита","Альбатрос","Альбатросчокер",
 "Аквилон","КонТики","Пассат","Антарктида","Амундсен",
 "Атлантида","Гибралтар","ГлубокийГоризонт","Корсар",
 "Кракен","ЛетучийГолландец","МысДобройНадежды",
 "Нерей","СеверныйЛедовитый","ТечениеЗападныхВетров",
 "Флибустьер","Штиль","Якорь","Гибралтарчокер","Антарктидачокер",
 "СеверныйЛедовитыйчокер","Снежура","Санторини"]
];

var handright = [];
var handleft = [];

for (var i = 0; i < col.length ; i++) {

    var answer = Math.floor(Math.random()*col.length);
    var end = col[answer];

    var answer1 = Math.floor(Math.random()*end.length);
    var end1 = end[answer1];

  handright.push(end1);
}

for (var j = 0; j < col.length ; j++) {

    var answer2 = Math.floor(Math.random()*col.length);
    var end2 = col[answer2];

    var answer3 = Math.floor(Math.random()*end.length);
    var end3 = end2[answer3];

  handleft.push(end3);
}



console.log(handright, handleft);

document.getElementById('right1').innerHTML = handright[0];
document.getElementById('left1').innerHTML = handleft[0];
document.getElementById('right2').innerHTML = handright[1];
document.getElementById('left2').innerHTML = handleft[1];
document.getElementById('right3').innerHTML = handright[2];
document.getElementById('left3').innerHTML = handleft[2];


document.getElementById('endform').addEventListener("submit", check);

function check(event) {
event.preventDefault();

window.location = "index.html";
}
